# This file was automatically generated from amharic_min_max.lang
# by the language transpiler

አንደኛ = 45
ሁለተኛ = 32
print("የመጀመሪያ ቁጥሮች:", አንደኛ, ሁለተኛ)
if (አንደኛ > ሁለተኛ):
    ትንሽ_ቁጥር = ሁለተኛ
    ትልቅ_ቁጥር = አንደኛ
else:
    ትንሽ_ቁጥር = አንደኛ
    ትልቅ_ቁጥር = ሁለተኛ
ልዩነት = (ትልቅ_ቁጥር - ትንሽ_ቁጥር)
print("ትንሽ ቁጥር:", ትንሽ_ቁጥር)
print("ትልቅ ቁጥር:", ትልቅ_ቁጥር)
print("ልዩነት:", ልዩነት)
ሶስተኛ = 78
አራተኛ = 101
print("የሁለተኛ ቁጥሮች:", ሶስተኛ, አራተኛ)
if (ሶስተኛ > አራተኛ):
    ሁለተኛ_ትንሽ = አራተኛ
    ሁለተኛ_ትልቅ = ሶስተኛ
else:
    ሁለተኛ_ትንሽ = ሶስተኛ
    ሁለተኛ_ትልቅ = አራተኛ
ሁለተኛ_ልዩነት = (ሁለተኛ_ትልቅ - ሁለተኛ_ትንሽ)
print("ሁለተኛ ትንሽ ቁጥር:", ሁለተኛ_ትንሽ)
print("ሁለተኛ ትልቅ ቁጥር:", ሁለተኛ_ትልቅ)
print("ሁለተኛ ልዩነት:", ሁለተኛ_ልዩነት)